function* milionater() {
    let gumar = 0;
    let result = yield `դուք ունեք ${gumar} դրամ   
    հիշեցնեմ դուք ունեք օգնության հնարավորություն
    «զանգ ընկերոջը»,«դահլիճի օգնություն»,«50֊50» 

    հարց 1֊ որ թվականին է քրիստոնեությունը ընդունվել որպես պետական կրոն 
    a)401    b)311
    c)301    d)701`
    if (result == "c") {
        gumar += 1000;
        alert(`ճիշտ պատասխան դուք վաստակեցիք 1000 դրամ
        պատրաստեք շարունակել խաղը`)
    } else {
        alert(`սխալպատասխան դուք պարտվեցիք `);
        return;
    }

    result = yield `    դուք ունեք ${gumar} դրամ 
    հիշեցնեմ դուք ունեք օգնության հնարավորություն
    «զանգ ընկերոջը»,«դահլիճի օգնություն»,«50֊50» 

  հարց 2֊ ով է ստեղծել հայոց այբուբենը 
    a)Կոմիտաս   b)Մեսրոպ Մաշտոց
    c)Այվազովսկի    d)Չարենց`
    if (result == 'b') {
        gumar += 2000;
        alert(`ճիշտ պատասխան դուք վաստակեցիք 2000 դրամ
        պատրաստեք շարունակել խաղը`)
    } else {
        alert(`սխալպատասխան դուք պարտվեցիք `);
        return;
    }

    result = yield `    դուք ունեք ${gumar} դրամ 
    հիշեցնեմ դուք ունեք օգնության հնարավորություն
    «զանգ ընկերոջը»,«դահլիճի օգնություն»,«50֊50»

  հարց 3֊ ով է գրել «Սասունցի Դավիթ»պոեմը
    a)Հովհաննես Թումանյան   b)Եղիշե Չարենց
    c)Պարույր Սևակ    d)Եզնիկ Կողբացի `
    if (result == 'a') {
        gumar += 2000;
        alert(`ճիշտ պատասխան դուք վաստակեցիք 2000 դրամ
        դուք ունեք 5000 դրամ և այն անձեռնմխելի է 
        պատրաստեք շարունակել խաղը`)
    } else {
        alert(`սխալպատասխան դուք պարտվեցիք
        բայց դուք այս խաղի ընթացքում շահեցիք 5000դրամ `);
        return;
    };
    result = yield `  դուք ունեք${gumar} դրամ  
    հիշեցնեմ դուք ունեք օգնության հնարավորություն
    «զանգ ընկերոջը»,«դահլիճի օգնություն»,«50֊50» 

  հարց 4֊ որն է Հայաստանի մայրաքաղաքը
    a)Գյումրի   b)Երևան
    c)Անի    d)Ապարան `
    if (result === 'b') {
        gumar += 5000;
        alert(`ճիշտ պատասխան դուք վաստակեցիք 5000 դրամ
        պատրաստեք շարունակել խաղը`)
    } else {
        alert(`սխալպատասխան դուք պարտվեցիք
        բայց դուք այս խաղի ընթացքում շահեցիք 5000դրամ `);
        return

    };

    result = yield `  դուք ունեք${gumar} դրամ  
    հիշեցնեմ դուք ունեք օգնության հնարավորություն
    «զանգ ընկերոջը»,«դահլիճի օգնություն»,«50֊50» 

  հարց 5֊ հաշվել արտահայտության արժեքը (15+10*(11+2))
  a)155   b)144
  c)141    d)145`
    if (result == 'd') {
        gumar += 10000;
        alert(`ճիշտ պատասխան 
    ֊֊֊֊֊֊֊֊֊֊խաղն ավարտվեց֊֊֊֊֊֊֊֊֊֊
        շնորհավորում եմ դուք հաղթեցիք և դուք այս խաղի ընթացքում վաստակեցիք ${gumar} դրամ`)
    } else {
        alert(`սխալպատասխան դուք պարտվեցիք
        բայց դուք այս խաղի ընթացքում շահեցիք 5000դրամ `);

    };




}

let game = milionater();
let obj = game.next()

while (!obj.done) {
    let answer = prompt(obj.value)

    obj = game.next(answer);
    if (obj.done) {
        console.log("Game Over")
    }

}